u1n11/M55M1_Mix_ZO_Trainer/SampleCode/MachineLearning/ImageClassification/Model/inference_mngt.cpp
#include <cstdio>
#include <cstring>
#include <cinttypes>
#include <string>
#include <vector>

/* MobileNetModel.hpp defines USE_SPLIT_MODEL — must be included before
 * inference_mngt.h so the conditional enum values are compiled in. */
#include "MobileNetModel.hpp"
#include "inference_mngt.h"
#include "../GlobalState.hpp"
#include "LogConfig.hpp"

#if defined(USE_SPLIT_MODEL) && (USE_SPLIT_MODEL == 1)
#include "ZOTrainer.hpp"
#endif

#undef PI
#include "NuMicro.h"
#include "log_macros.h"

#if (MODEL_MODE) == MODEL_MODE_SINGLE_CPU
/* The full CPU (non-NPU) model's activation arena exceeds on-chip SRAM, so it
 * is placed in external HyperRAM (memory-mapped at 0x82000000 via SPIM DMM). */
#include "hyperflash_code.h"   /* SPIM_HyperRAM_Init() */
#endif

#include "BufAttributes.hpp"
#include "Labels.hpp"

#ifndef CPU_ACTIVATION_BUF_SZ
    #define CPU_ACTIVATION_BUF_SZ  0x00020000  /* 128 KB */
#endif

#if defined (__USE_DISPLAY__)
    #include "Display.h"
#endif
#if defined(__PROFILE__)
    #include "Profiler.hpp"
#endif
#include "pmu_counter.h"

/* ------------------------------------------------------------------ */
/*  External / Shared defines                                         */
/* ------------------------------------------------------------------ */
namespace arm
{
namespace app
{
extern uint8_t tensorArena[ACTIVATION_BUF_SZ];
extern uint8_t cpuTensorArena[];

#if !(defined(USE_SPLIT_MODEL) && (USE_SPLIT_MODEL == 1))
/* Optional getter function for the model pointer and its size.
 * SINGLE_MODEL_NS resolves to `mobilenet` (NPU/vela) or `baseline_w035`
 * (CPU int8) depending on MODEL_MODE — see MobileNetModel.hpp. */
namespace SINGLE_MODEL_NS
{
extern const uint8_t *GetModelPointer();
extern size_t GetModelLen();
} /* namespace SINGLE_MODEL_NS */
#endif /* !USE_SPLIT_MODEL */

} /* namespace app */
} /* namespace arm */

extern char fb_array[]; /* frame buffer array defined in main.cpp */

/* ------------------------------------------------------------------ */
/*  Split model namespace externs                                     */
/* ------------------------------------------------------------------ */
#if defined(USE_SPLIT_MODEL) && (USE_SPLIT_MODEL == 1)
namespace arm {
namespace app {
namespace feature_extractor_npu {
    extern const uint8_t *GetModelPointer();
    extern size_t GetModelLen();
}
namespace classifier_cpu_int8 {
    extern const uint8_t *GetModelPointer();
    extern size_t GetModelLen();
}
} /* namespace app */
} /* namespace arm */
#endif /* USE_SPLIT_MODEL */

/* ------------------------------------------------------------------ */
/*  State Machine Variables                                           */
/* ------------------------------------------------------------------ */
static ISM_State_t g_currentState = ISM_IDLE;
static ISM_State_t g_requestState = ISM_IDLE;
static bool g_modelLoadFailed = false; /* set after Init() fails; prevents crash-inducing retry */

#if defined(USE_SPLIT_MODEL) && (USE_SPLIT_MODEL == 1)
static bool g_zoLoadedFromFlash = false;
static uint32_t g_zoPersistedTrainSteps = 0;
#endif

/* ------------------------------------------------------------------ */
/*  Helper Functions (Internal)                                       */
/* ------------------------------------------------------------------ */

static std::string BuildTopKResultString(const std::vector<arm::app::ClassificationResult> &vec,
                                         size_t topK)
{
    if (vec.empty())
    {
        return std::string("???");
    }

    const size_t count = (vec.size() < topK) ? vec.size() : topK;
    std::string text;

    for (size_t i = 0; i < count; ++i)
    {
        if (i > 0)
        {
            text += std::string(", ");
        }
        text += vec[i].m_label + std::string(" ") + std::to_string(vec[i].m_normalisedVal);
    }

    return text;
}

/* ------------------------------------------------------------------ */
/*  Center-crop ROI helper                                            */
/* ------------------------------------------------------------------ */
/* A centered SQUARE ROI scaled to the square model input fixes the
 * 4:3 (320x240) -> 1:1 (224x224) aspect distortion that plain full-frame
 * stretching causes. The square crop itself is mandatory; only the zoom
 * factor below is a tuning knob.
 *
 * kCropFraction = fraction of the shorter side kept as the square crop:
 *   224/256 = 0.875  -> exactly matches PC Resize(256)+CenterCrop(224),
 *                       but zooms in and may clip an object that already
 *                       fills the camera frame.
 *   1.0              -> keeps the full shorter side (only the unavoidable
 *                       4:3->1:1 horizontal excess is dropped, 0% vertical),
 *                       never cuts into the object. Best when the camera
 *                       already frames the object near full-frame.
 * Start at 1.0; A/B test against 0.875 if accuracy still lags. */
static constexpr float kCropFraction = 1.0f;

static void SetCenterCropRoi(rectangle_t &r, const image_t &frame)
{
    const int shortSide = (frame.w < frame.h) ? frame.w : frame.h;
    int crop = (int)((float)shortSide * kCropFraction + 0.5f);
    if (crop < 1)         crop = shortSide;   /* degenerate-size guard */
    if (crop > shortSide) crop = shortSide;   /* never exceed the frame  */

    r.w = crop;
    r.h = crop;
    r.x = (frame.w - crop) / 2;               /* centered */
    r.y = (frame.h - crop) / 2;
}

#if !(defined(USE_SPLIT_MODEL) && (USE_SPLIT_MODEL == 1))

#if (MODEL_MODE) == MODEL_MODE_SINGLE_CPU
/* ------------------------------------------------------------------ */
/*  HyperRAM tensor arena (CPU single model)                          */
/* ------------------------------------------------------------------ */
/* The full int8 MobileNetV2 run entirely on the CPU needs >1.1 MB of
 * activation arena, which does not fit in the 1 MB NPU-side SRAM. The
 * board carries an 8 MB HyperRAM that the SPIM exposes as normal,
 * memory-mapped RAM at 0x82000000 once put in Direct-Map mode, so the
 * CPU arena lives there instead. (The NPU cannot reach HyperRAM, hence
 * this path is CPU-only; the NPU build keeps the SRAM arena.) */
#define HYPERRAM_ARENA_ADDR   (0x82000000UL)   /* SPIM0 DMM base (SPIM_HYPER_DMM0_SADDR) */
#define HYPERRAM_ARENA_SZ     (0x00200000UL)   /* 2 MB — ample headroom over the ~1.2 MB peak */

static bool g_hyperRamReady = false;

/* Bring up HyperRAM (clock, pins, DLL training, enter DMM) once, then do a
 * lightweight start/mid/end round-trip check on the memory-mapped arena. */
static bool EnsureHyperRamArena(void)
{
    if (g_hyperRamReady)
    {
        return true;
    }

    info_if_token(LOG_MODEL_LOAD, "[ISM] Initialising HyperRAM (SPIM0 Direct-Map)...\r\n");

    /* SPIM clock / pin MFP setup touch protected registers. */
    SYS_UnlockReg();
    SPIM_HyperRAM_Init(SPIM0);
    SYS_LockReg();

    /* Round-trip sanity test at start / middle / end of the arena. Clean+invalidate
     * the D-cache between write and read so the read really fetches from HyperRAM
     * rather than returning a cached copy. */
    volatile uint32_t *p   = (volatile uint32_t *)HYPERRAM_ARENA_ADDR;
    const uint32_t pattern = 0xDEADBEEFUL;
    const uint32_t words   = (uint32_t)(HYPERRAM_ARENA_SZ / sizeof(uint32_t));
    const uint32_t probes[3] = { 0u, words / 2u, words - 1u };

    for (int i = 0; i < 3; i++) { p[probes[i]] = pattern; }
    SCB_CleanInvalidateDCache();
    for (int i = 0; i < 3; i++)
    {
        uint32_t got = p[probes[i]];
        if (got != pattern)
        {
            printf_err("[ISM] HyperRAM sanity FAILED @word %u: got 0x%08X, expected 0x%08X\r\n",
                       (unsigned)probes[i], (unsigned)got, (unsigned)pattern);
            return false;
        }
    }

    g_hyperRamReady = true;
    info_if_token(LOG_MODEL_LOAD, "[ISM] HyperRAM ready @0x%08X (%u bytes)\r\n",
                  (unsigned)HYPERRAM_ARENA_ADDR, (unsigned)HYPERRAM_ARENA_SZ);
    return true;
}
#endif /* MODEL_MODE_SINGLE_CPU */

static void DoLoadModel(void)
{
    if (modelLoaded)
    {
        info("[ISM] Model already loaded\r\n");
        return;
    }

    if (g_modelLoadFailed)
    {
        printf_err("[ISM] Model previously failed to load. Reset MCU to retry.\r\n");
        return;
    }

    info_if_token(LOG_MODEL_LOAD, "[ISM] Loading model...\r\n");

    extern uint32_t SystemCoreClock;
    const uint64_t t0 = pmu_get_systick_Count();

    const uint8_t *modelPtr = arm::app::SINGLE_MODEL_NS::GetModelPointer();
    size_t         modelLen = arm::app::SINGLE_MODEL_NS::GetModelLen();
    const tflite::Model *fbModel = ::tflite::GetModel(modelPtr);

#if (MODEL_MODE) == MODEL_MODE_SINGLE_CPU
    /* CPU model: arena lives in external HyperRAM (does not fit on-chip SRAM). */
    if (!EnsureHyperRamArena())
    {
        printf_err("[ISM] HyperRAM unavailable; cannot load CPU model\r\n");
        g_modelLoadFailed = true;
        return;
    }
    uint8_t *arenaPtr  = (uint8_t *)HYPERRAM_ARENA_ADDR;
    uint32_t arenaSize = (uint32_t)HYPERRAM_ARENA_SZ;
    const uint8_t arenaMpuAttr = eMPU_ATTR_CACHEABLE_WBWARA; /* write-back: best for slow external RAM */
    info_if_token(LOG_MODEL_LOAD, "[ISM] Using HyperRAM tensor arena @0x%08X (%u bytes)\r\n",
                  (unsigned)arenaPtr, arenaSize);
#else
    uint8_t *arenaPtr  = arm::app::tensorArena;
    uint32_t arenaSize = sizeof(arm::app::tensorArena);
    const uint8_t arenaMpuAttr = eMPU_ATTR_CACHEABLE_WTRA;   /* SRAM */
    info_if_token(LOG_MODEL_LOAD, "[ISM] Using SRAM tensor arena (%u bytes)\r\n", arenaSize);
#endif

    /* Dump all operator types required by this model for diagnostics */
    if (fbModel && fbModel->operator_codes())
    {
        const auto *opcodes = fbModel->operator_codes();
        info_if_token(LOG_MODEL_LOAD, "[ISM] Model requires %u operator type(s):\r\n", (unsigned)opcodes->size());
        for (uint32_t i = 0; i < opcodes->size(); i++)
        {
            const auto *opcode = opcodes->Get(i);
            auto builtinCode = tflite::GetBuiltinCode(opcode);
            if (builtinCode == tflite::BuiltinOperator_CUSTOM)
            {
                const char *name = opcode->custom_code() ? opcode->custom_code()->c_str() : "CUSTOM";
                info_if_token(LOG_MODEL_LOAD, "[ISM]   [%u] CUSTOM: %s\r\n", i, name);
            }
            else
            {
                info_if_token(LOG_MODEL_LOAD, "[ISM]   [%u] %s\r\n", i, tflite::EnumNameBuiltinOperator(builtinCode));
            }
        }
    }

    /* Check quantization of CONV_2D / DEPTHWISE_CONV_2D filter tensors */
    if (fbModel && fbModel->subgraphs() && fbModel->subgraphs()->size() > 0)
    {
        const auto *subgraph = fbModel->subgraphs()->Get(0);
        const auto *operators = subgraph->operators();
        const auto *tensors   = subgraph->tensors();
        const auto *opcodes   = fbModel->operator_codes();

        if (operators && tensors && opcodes)
        {
            info_if_token(LOG_MODEL_LOAD, "[ISM] Checking conv/fc filter quantization...\r\n");
            for (uint32_t i = 0; i < operators->size(); i++)
            {
                const auto *op = operators->Get(i);
                const auto *opcode = opcodes->Get(op->opcode_index());
                auto code = tflite::GetBuiltinCode(opcode);

                if (code != tflite::BuiltinOperator_CONV_2D &&
                    code != tflite::BuiltinOperator_DEPTHWISE_CONV_2D &&
                    code != tflite::BuiltinOperator_FULLY_CONNECTED)
                    continue;

                const char *opName = tflite::EnumNameBuiltinOperator(code);

