u1n11/M55M1_Mix_ZO_Trainer/SampleCode/MachineLearning/ImageClassification/Model/inference_mngt.cpp
                /* inputs[1] = filter tensor */
                if (op->inputs() && op->inputs()->size() >= 2)
                {
                    int filterIdx = op->inputs()->Get(1);
                    const auto *filterT = tensors->Get(filterIdx);
                    const char *tType = tflite::EnumNameTensorType(filterT->type());

                    int scaleCount = 0;
                    if (filterT->quantization() && filterT->quantization()->scale())
                        scaleCount = (int)filterT->quantization()->scale()->size();

                    int shapeOC = 0;
                    if (filterT->shape())
                    {
                        const unsigned int ocDim = (code == tflite::BuiltinOperator_DEPTHWISE_CONV_2D) ? 3u : 0u;
                        if (filterT->shape()->size() > ocDim)
                        {
                            shapeOC = filterT->shape()->Get(ocDim);
                        }
                    }

                    info_if_token(LOG_MODEL_LOAD, "[ISM]   OP[%u] %s filter=T[%d] type=%s OC=%d scales=%d %s\r\n",
                         i, opName, filterIdx, tType, shapeOC, scaleCount,
                        (scaleCount == shapeOC) ? "PER-CHANNEL" :
                        (scaleCount == 1)       ? "PER-TENSOR" : "UNKNOWN(!)");

                    if (code == tflite::BuiltinOperator_FULLY_CONNECTED && scaleCount != 1)
                    {
                        printf_err("[ISM]   FULLY_CONNECTED filter is not per-tensor (scales=%d). "
                                "This TFLM build requires scales=1 for FC.\r\n",
                                scaleCount);
                    }
                }

                /* inputs[2] = bias tensor */
                if (op->inputs() && op->inputs()->size() >= 3)
                {
                    int biasIdx = op->inputs()->Get(2);
                    if (biasIdx >= 0)
                    {
                        const auto *biasT = tensors->Get(biasIdx);
                        int biasDims = biasT->shape() ? (int)biasT->shape()->size() : 0;
                        info_if_token(LOG_MODEL_LOAD, "[ISM]         bias=T[%d] type=%s dims=%dD shape=[",
                             biasIdx, tflite::EnumNameTensorType(biasT->type()), biasDims);
                        if (IsLogTokenEnabled(LOG_MODEL_LOAD) && biasT->shape()) {
                            for (int s = 0; s < (int)biasT->shape()->size(); s++) {
                                if (s > 0) info_if_token(LOG_MODEL_LOAD, ",");
                                info_if_token(LOG_MODEL_LOAD, "%d", biasT->shape()->Get(s));
                            }
                        }
                        info_if_token(LOG_MODEL_LOAD, "]\r\n");
                    }
                }
            }
        }
    }

    if (!model.Init(arenaPtr, arenaSize, modelPtr, modelLen))
    {
        printf_err("[ISM] Failed to initialise model\r\n");
        g_modelLoadFailed = true;
        return;
    }

    /* Setup cache policy of tensor arena buffer */
    const std::vector<ARM_MPU_Region_t> mpuConfig =
    {
        {
            // Tensor arena (SRAM for NPU model, HyperRAM for CPU model)
            ARM_MPU_RBAR(((unsigned int)arenaPtr),             // Base
                         ARM_MPU_SH_NON,    // Non-shareable
                         0,                 // Read-only
                         1,                 // Non-Privileged
                         1),                // eXecute Never enabled
            ARM_MPU_RLAR((((unsigned int)arenaPtr) + arenaSize - 1),  // Limit
                         arenaMpuAttr)      // WTRA for SRAM, WBWARA for HyperRAM
        },
#if defined (__USE_CCAP__)
        {
            // Image data from CCAP DMA => Non-cacheable
             ARM_MPU_RBAR(((unsigned int)fb_array),        // Base
                          ARM_MPU_SH_NON,    // Non-shareable
                          0,                 // Read-only
                          1,                 // Non-Privileged
                          1),                // eXecute Never enabled
             ARM_MPU_RLAR((((unsigned int)fb_array) + OMV_FB_SIZE - 1),        // Limit
                          eMPU_ATTR_NON_CACHEABLE) // NonCache
        }
#endif
    };

    // Setup MPU configuration
    InitPreDefMPURegion(&mpuConfig[0], mpuConfig.size());

    inputTensor = model.GetInputTensor(0);

    if (!inputTensor->dims || inputTensor->dims->size < 3)
    {
        printf_err("[ISM] Invalid input tensor dims\r\n");
    }
    else
    {
        TfLiteIntArray *inputShape = model.GetInputShape(0);
        inputImgCols   = inputShape->data[arm::app::MobileNetModel::ms_inputColsIdx];
        inputImgRows   = inputShape->data[arm::app::MobileNetModel::ms_inputRowsIdx];
        inputChannels  = inputShape->data[arm::app::MobileNetModel::ms_inputChannelsIdx];

        GetLabelsVector(labels);

        preProcess  = new arm::app::ImgClassPreProcess(&model);
        postProcess = new arm::app::ImgClassPostProcess(classifier, &model,
                                                        labels, results);

        modelLoaded = true;

        size_t arenaUsed = model.GetArenaUsedBytes();
        uint64_t elapsed = pmu_get_systick_Count() - t0;
        float elapsedMs = (float)elapsed * 1000.0f / (float)SystemCoreClock;
        info_critical("[LOAD] time=%.2fms mem=%zu/%uB zo=N/A\r\n",
                  elapsedMs, arenaUsed, arenaSize);
        info_if_token(LOG_MODEL_INIT, "[ISM] Model loaded success\r\n");
    }
}

static void DoInference(void)
{
    if (!modelLoaded)
    {
        info("[ISM] Model not loaded, loading now...\r\n");
        DoLoadModel();
        if (!modelLoaded) return;
    }

    /* Freeze frameBuffer to ensure consistent inference frame */
    extern uint32_t inferenceFrameCount;
    extern bool frameBufferFrozen;
    inferenceFrameCount++;
    frameBufferFrozen = true;

    /* Resize framebuffer image to model input */
    image_t resizeImg;

    /* Center-crop (match PC Resize(256)+CenterCrop(224)) instead of
     * stretching the whole frame into the square model input. */
    SetCenterCropRoi(roi, frameBuffer);

