u1n11/M55M1_Mix_ZO_Trainer/SampleCode/MachineLearning/ImageClassification/Model/inference_mngt.cpp
    std::memcpy(snapshot.data() + sizeof(ZoFlashHeader), weights, (size_t)fc.weight_bytes);
    if (fc.bias_bytes > 0)
    {
        if (!bias)
        {
            printf_err("[ZO] Cannot save: mutable bias pointer is null\r\n");
            return false;
        }
        std::memcpy(snapshot.data() + sizeof(ZoFlashHeader) + (size_t)fc.weight_bytes,
                    bias, (size_t)fc.bias_bytes);
    }

    hdr.payloadChecksum = CalcFnv1a(snapshot.data() + sizeof(ZoFlashHeader), payloadBytes);
    std::memcpy(snapshot.data(), &hdr, sizeof(ZoFlashHeader));

    if (!FlashWriteBytes(kZoFlashRegionAddr, snapshot.data(), snapshot.size()))
    {
        printf_err("[ZO] Failed to save snapshot to APROM flash\r\n");
        return false;
    }

    g_zoPersistedTrainSteps = hdr.stepCount;
    info_critical("[ZO] Snapshot saved to flash @0x%08X (steps=%u)\r\n",
                  kZoFlashRegionAddr, hdr.stepCount);
    return true;
}

static bool TryLoadZOTrainerSnapshotFromFlash(void)
{
    if (!zoTrainer || !zoTrainer->IsInitialized())
    {
        return false;
    }

    ZoFlashHeader hdr{};
    FlashReadBytes(kZoFlashRegionAddr, reinterpret_cast<uint8_t *>(&hdr), sizeof(hdr));

    const ZOTrainer::FCInfo &fc = zoTrainer->GetFCInfo();
    const uint32_t expectedPayload = (uint32_t)((size_t)fc.weight_bytes + (size_t)fc.bias_bytes);

    if (hdr.magic != kZoFlashMagic || hdr.version != kZoFlashVersion)
    {
        info_if_token(LOG_ZO_TRAINING,
                      "[ZO] Flash header invalid: magic=0x%08X version=%u (expect 0x%08X/%u)\r\n",
                      hdr.magic, hdr.version, kZoFlashMagic, kZoFlashVersion);
        g_zoLoadedFromFlash = false;
        g_zoPersistedTrainSteps = 0;
        return false;
    }

    if (hdr.payloadBytes > (kZoFlashRegionBytes - sizeof(ZoFlashHeader)))
    {
        printf_err("[ZO] Flash snapshot payload too large; using built-in weights\r\n");
        g_zoLoadedFromFlash = false;
        g_zoPersistedTrainSteps = 0;
        return false;
    }

    if (hdr.payloadBytes != expectedPayload ||
        hdr.inputFeatures != (uint32_t)fc.input_features ||
        hdr.outputClasses != (uint32_t)fc.output_classes)
    {
        printf_err("[ZO] Flash snapshot header mismatch; using built-in weights\r\n");
        g_zoLoadedFromFlash = false;
        g_zoPersistedTrainSteps = 0;
        return false;
    }

    std::vector<uint8_t> payload(hdr.payloadBytes, 0);
    FlashReadBytes(kZoFlashRegionAddr + (uint32_t)sizeof(ZoFlashHeader),
                   payload.data(), payload.size());

    const uint32_t checksum = CalcFnv1a(payload.data(), payload.size());
    if (checksum != hdr.payloadChecksum)
    {
        printf_err("[ZO] Flash snapshot checksum mismatch; using built-in weights\r\n");
        g_zoLoadedFromFlash = false;
        g_zoPersistedTrainSteps = 0;
        return false;
    }

    const int8_t *w = reinterpret_cast<const int8_t *>(payload.data());
    const uint8_t *b = payload.data() + (size_t)fc.weight_bytes;

    if (!zoTrainer->LoadFromSnapshot(w, (size_t)fc.weight_bytes, b,
                                     (size_t)fc.bias_bytes, (int)hdr.stepCount))
    {
        printf_err("[ZO] Failed to apply flash snapshot; using built-in weights\r\n");
        g_zoLoadedFromFlash = false;
        g_zoPersistedTrainSteps = 0;
        return false;
    }

    g_zoLoadedFromFlash = true;
    g_zoPersistedTrainSteps = hdr.stepCount;
    info_critical("[ZO] Loaded classifier snapshot from flash (steps=%u)\r\n", hdr.stepCount);
    return true;
}

} // namespace

static void DoZOInit(void);

static void DoLoadSplitModel(void)
{
    if (splitModelLoaded)
    {
        info("[ISM] Split models already loaded\r\n");
        return;
    }

    if (g_modelLoadFailed)
    {
        printf_err("[ISM] Model previously failed to load. Reset MCU to retry.\r\n");
        return;
    }

    info_if_token(LOG_MODEL_LOAD, "[ISM] Loading split models (extractor + classifier)...\r\n");

    extern uint32_t SystemCoreClock;
    const uint64_t t0 = pmu_get_systick_Count();

    /* ---- Feature Extractor (NPU → SRAM arena) ---- */
    const uint8_t *extPtr  = arm::app::feature_extractor_npu::GetModelPointer();
    size_t         extLen  = arm::app::feature_extractor_npu::GetModelLen();
    uint8_t       *extArena     = arm::app::tensorArena;
    uint32_t       extArenaSize = sizeof(arm::app::tensorArena);

    info_if_token(LOG_MODEL_LOAD, "[ISM] Feature extractor: %zu bytes, SRAM arena %u bytes\r\n",
         extLen, extArenaSize);

    if (!extractorModel.Init(extArena, extArenaSize, extPtr, extLen))
    {
        printf_err("[ISM] Failed to init feature extractor model\r\n");
        g_modelLoadFailed = true;
        return;
    }

    /* ---- Classifier (CPU → SRAM arena) ---- */
    const uint8_t *clsPtr  = arm::app::classifier_cpu_int8::GetModelPointer();
    size_t         clsLen  = arm::app::classifier_cpu_int8::GetModelLen();
    uint8_t       *clsArena     = arm::app::cpuTensorArena;
    uint32_t       clsArenaSize = CPU_ACTIVATION_BUF_SZ;

    info_if_token(LOG_MODEL_LOAD, "[ISM] Classifier: %zu bytes, SRAM arena %u bytes at 0x%p\r\n",
         clsLen, clsArenaSize, clsArena);

    if (!classifierModel.Init(clsArena, clsArenaSize, clsPtr, clsLen))
    {
        printf_err("[ISM] Failed to init classifier model\r\n");
        g_modelLoadFailed = true;
        return;
    }

    /* ---- Verify intermediate tensor compatibility ---- */
    TfLiteTensor *extOutput = extractorModel.GetOutputTensor(0);
    TfLiteTensor *clsInput  = classifierModel.GetInputTensor(0);

    info_if_token(LOG_MODEL_LOAD, "[ISM] Extractor output: %zu bytes, Classifier input: %zu bytes\r\n",
         extOutput->bytes, clsInput->bytes);

    if (extOutput->bytes != clsInput->bytes)
    {
        printf_err("[ISM] Shape mismatch! extractor output %zu != classifier input %zu\r\n",
                   extOutput->bytes, clsInput->bytes);
        g_modelLoadFailed = true;
        return;
    }

    /* ---- MPU: mark tensor arenas as write-through cacheable ---- */
    const std::vector<ARM_MPU_Region_t> mpuConfig =
    {
        {
            /* SRAM tensor arena (extractor / NPU) */
            ARM_MPU_RBAR(((unsigned int)extArena),
                         ARM_MPU_SH_NON, 0, 1, 1),
            ARM_MPU_RLAR((((unsigned int)extArena) + extArenaSize - 1),
                         eMPU_ATTR_CACHEABLE_WTRA)
        },
#if defined (__USE_CCAP__)
        {
            ARM_MPU_RBAR(((unsigned int)fb_array),
                         ARM_MPU_SH_NON, 0, 1, 1),
            ARM_MPU_RLAR((((unsigned int)fb_array) + OMV_FB_SIZE - 1),
                         eMPU_ATTR_NON_CACHEABLE)
        }
#endif
    };
    InitPreDefMPURegion(&mpuConfig[0], mpuConfig.size());

    /* ---- Setup image input from extractor ---- */
    inputTensor = extractorModel.GetInputTensor(0);

    if (!inputTensor->dims || inputTensor->dims->size < 3)
    {
        printf_err("[ISM] Invalid extractor input tensor dims\r\n");
        g_modelLoadFailed = true;
        return;
    }

    TfLiteIntArray *inputShape = extractorModel.GetInputShape(0);
    inputImgCols  = inputShape->data[arm::app::MobileNetModel::ms_inputColsIdx];
    inputImgRows  = inputShape->data[arm::app::MobileNetModel::ms_inputRowsIdx];
    inputChannels = inputShape->data[arm::app::MobileNetModel::ms_inputChannelsIdx];

    GetLabelsVector(labels);

    /* Pre-process feeds the extractor; post-process reads the classifier */
    preProcess  = new arm::app::ImgClassPreProcess(&extractorModel);
    postProcess = new arm::app::ImgClassPostProcess(classifier, &classifierModel,
                                                    labels, results);

    splitModelLoaded = true;
    modelLoaded      = true; /* backward compat flag */

    g_zoLoadedFromFlash = false;
    g_zoPersistedTrainSteps = 0;

    /* Auto-restore persisted ZO snapshot on model load so reboot + load_model
     * immediately reuses trained classifier parameters if available. */
    DoZOInit();

    const size_t extUsed = extractorModel.GetArenaUsedBytes();
    const size_t clsUsed = classifierModel.GetArenaUsedBytes();
    const size_t totalUsed = extUsed + clsUsed;
    const size_t totalArena = (size_t)extArenaSize + (size_t)clsArenaSize;
    uint64_t elapsed = pmu_get_systick_Count() - t0;
    float elapsedMs = (float)elapsed * 1000.0f / (float)SystemCoreClock;
    const char *zoState = g_zoLoadedFromFlash ? "YES" : "NO";
    info_critical("[LOAD] time=%.2fms mem=%zu/%zuB zo=%s\r\n",
                  elapsedMs, totalUsed, totalArena, zoState);
    info_if_token(LOG_MODEL_INIT, "[ISM] Split models loaded successfully\r\n");
}

static void DoSplitInference(void)
{
    if (!splitModelLoaded)
    {
        info("[ISM] Split models not loaded, loading now...\r\n");
        DoLoadSplitModel();
        if (!splitModelLoaded) return;
    }

    /* Freeze frameBuffer to ensure consistent inference frame */
    extern uint32_t inferenceFrameCount;
    extern bool frameBufferFrozen;
    inferenceFrameCount++;
    frameBufferFrozen = true;

