u1n11/M55M1_Mix_ZO_Trainer/SampleCode/MachineLearning/ImageClassification/Model/inference_mngt.cpp
    /* ---- Resize camera frame → extractor input ---- */
    image_t resizeImg;

    /* Center-crop (match PC Resize(256)+CenterCrop(224)) instead of
     * stretching the whole frame into the square model input. */
    SetCenterCropRoi(roi, frameBuffer);

    resizeImg.w = inputImgCols;
    resizeImg.h = inputImgRows;
    resizeImg.data = (uint8_t *)inputTensor->data.data;
    resizeImg.pixfmt = PIXFORMAT_RGB888;

    imlib_nvt_scale(&frameBuffer, &resizeImg, &roi);

    /* Pre-processing (image → extractor input tensor) */
    if (!preProcess->DoPreProcess(resizeImg.data,
                                  (resizeImg.w * resizeImg.h * inputChannels)))
    {
        printf_err("[ISM] Pre-processing failed\r\n");
        extern bool frameBufferFrozen;
        frameBufferFrozen = false;
        return;
    }

    extern uint32_t SystemCoreClock;

    /* ---- Stage 1: Feature Extractor (NPU) ---- */
    uint64_t t0 = pmu_get_systick_Count();

    if (!extractorModel.RunInference())
    {
        printf_err("[ISM] Feature extractor inference failed\r\n");
        extern bool frameBufferFrozen;
        frameBufferFrozen = false;
        return;
    }

    uint64_t t_ext = pmu_get_systick_Count() - t0;

    /* ---- Copy intermediate features: extractor output → classifier input ---- */
    TfLiteTensor *extOutput = extractorModel.GetOutputTensor(0);
    TfLiteTensor *clsInput  = classifierModel.GetInputTensor(0);
    std::memcpy(clsInput->data.data, extOutput->data.data, extOutput->bytes);

    /* ---- Stage 2: Classifier (CPU) ---- */
    uint64_t t1 = pmu_get_systick_Count();

    if (!classifierModel.RunInference())
    {
        printf_err("[ISM] Classifier inference failed\r\n");
        extern bool frameBufferFrozen;
        frameBufferFrozen = false;
        return;
    }

    uint64_t t_cls   = pmu_get_systick_Count() - t1;
    uint64_t t_total = pmu_get_systick_Count() - t0;

    /* ---- Post-processing (classifier output → label) ---- */
    std::string predictLabelInfo;
    std::string top5LabelInfo;
    if (postProcess->DoPostProcess())
    {
        top5LabelInfo = BuildTopKResultString(results, 5);
        predictLabelInfo = BuildTopKResultString(results, 1);
    }
    else
    {
        top5LabelInfo = std::string("???");
        predictLabelInfo = std::string("???");
    }

    uint32_t ext_us   = (uint32_t)(t_ext   * 1000000ULL / SystemCoreClock);
    uint32_t cls_us   = (uint32_t)(t_cls   * 1000000ULL / SystemCoreClock);
    uint32_t total_us = (uint32_t)(t_total * 1000000ULL / SystemCoreClock);

    char totalTimingBuf[16];
    char splitTimingBuf[48];
    snprintf(totalTimingBuf, sizeof(totalTimingBuf), "%.2fms", total_us / 1000.0f);
    snprintf(splitTimingBuf, sizeof(splitTimingBuf), "ext:%.2f+cls:%.2f",
             ext_us / 1000.0f, cls_us / 1000.0f);

    info_critical("[FRAME: %u] [RESULT] %s (%s) (%s)\r\n", inferenceFrameCount, top5LabelInfo.c_str(), totalTimingBuf,
                  splitTimingBuf);
    lastInferenceResult = predictLabelInfo + std::string(" (") + totalTimingBuf + std::string(") (")
                      + splitTimingBuf + std::string(")");

    /* Unfreeze frameBuffer after inference completes */
    frameBufferFrozen = false;
}

/* ------------------------------------------------------------------ */
/*  ZO Training: Init and Train                                       */
/* ------------------------------------------------------------------ */

static void DoZOInit(void)
{
    /* Ensure split model is loaded first */
    if (!splitModelLoaded)
    {
        info("[ZO] Split model not loaded, loading now...\r\n");
        DoLoadSplitModel();
        if (!splitModelLoaded) return;
    }

    /* If we haven't yet re-initialised the classifier with preserve_all_tensors,
     * we need to re-init it. The first load uses the standard allocator path.
     * On zo_init we reload using preserveAllTensors=true. */
    const uint8_t *clsPtr      = arm::app::classifier_cpu_int8::GetModelPointer();
    size_t         clsLen      = arm::app::classifier_cpu_int8::GetModelLen();
    uint8_t       *clsArena    = arm::app::cpuTensorArena;
    uint32_t       clsArenaSize = CPU_ACTIVATION_BUF_SZ;

    info_if_token(LOG_ZO_TRAINING, "[ZO] Re-initialising classifier with preserve_all_tensors=true...\r\n");

    /* Reinitialise classifierModel to preserve all tensors */
    if (!classifierModel.Init(clsArena, clsArenaSize, clsPtr, clsLen,
                              nullptr, /* allocator */
                              true     /* preserveAllTensors */))
    {
        printf_err("[ZO] Failed to re-init classifier with preserve_all_tensors\r\n");
        return;
    }

    /* Update postProcess to use the freshly initialised classifier model */
    if (postProcess) {
        delete postProcess;
    }
    postProcess = new arm::app::ImgClassPostProcess(classifier, &classifierModel,
                                                    labels, results);

    /* Allocate ZOTrainer if not yet done */
    if (!zoTrainer) {
        zoTrainer = new ZOTrainer();
    }

    /* Calculate scratch buffer start: arena base + arena used + 1KB alignment guard */
    size_t arenaUsed    = classifierModel.GetArenaUsedBytes();
    size_t guardBytes   = 1024u;
    uint8_t* scratchBuf = clsArena + arenaUsed + guardBytes;
    size_t   scratchSz  = (size_t)clsArenaSize - arenaUsed - guardBytes;

    if (!zoTrainer->Init(classifierModel, scratchBuf, scratchSz))
    {
        printf_err("[ZO] ZOTrainer init failed\r\n");
        return;
    }

    if (!TryLoadZOTrainerSnapshotFromFlash())
    {
        info_critical("[ZO] Weight source: BUILTIN (no valid flash snapshot)\r\n");
    }
    else
    {
        info_critical("[ZO] Weight source: FLASH\r\n");
    }

    const ZOTrainer::FCInfo& fc = zoTrainer->GetFCInfo();
    info_critical("[ZO] Ready. FC[%d in × %d out], mem=%zu bytes\r\n",
         fc.input_features, fc.output_classes, zoTrainer->GetMemoryUsed());
    info_if_token(LOG_ZO_TRAINING, "[ZO] Commands: tra=<label>  zo_reset  zo_lr <val>  zo_q <val>\r\n");
}

static void DoZOTrain(void)
{
    if (!zoTrainer || !zoTrainer->IsInitialized())
    {
        printf_err("[ZO] Trainer not initialised. Send 'zo_init' first.\r\n");
        return;
    }

    if (zoTargetLabel < 0 || zoTargetLabel >= zoTrainer->GetFCInfo().output_classes)
    {
        printf_err("[ZO] Invalid target label index %d\r\n", zoTargetLabel);
        return;
    }

    /* Freeze frameBuffer to ensure consistent training frame */
    extern uint32_t inferenceFrameCount;
    extern bool frameBufferFrozen;
    inferenceFrameCount++;
    frameBufferFrozen = true;

    /* ---- Extract features from current camera frame ---- */
    if (!splitModelLoaded)
    {
        printf_err("[ZO] Split model not loaded\r\n");
        return;
    }

    /* Resize camera frame → extractor input */
    image_t resizeImg;
    /* Center-crop (match PC Resize(256)+CenterCrop(224)) instead of
     * stretching the whole frame into the square model input. */
    SetCenterCropRoi(roi, frameBuffer);

