u1n11/M55M1_Mix_ZO_Trainer/SampleCode/MachineLearning/ImageClassification/Model/inference_mngt.cpp
    /* ---- Operator Graph ---- */
    printf("\r\n========== OPERATOR GRAPH (%d ops) ==========\r\n",
         operators ? (int)operators->size() : 0);

    if (operators && opcodes)
    {
        for (uint32_t i = 0; i < operators->size(); i++)
        {
            const tflite::Operator *op = operators->Get(i);
            const tflite::OperatorCode *opcode = opcodes->Get(op->opcode_index());

            /* Resolve operator name */
            auto builtinCode = tflite::GetBuiltinCode(opcode);
            const char *opName;
            if (builtinCode == tflite::BuiltinOperator_CUSTOM)
            {
                opName = opcode->custom_code() ? opcode->custom_code()->c_str() : "CUSTOM";
            }
            else
            {
                opName = tflite::EnumNameBuiltinOperator(builtinCode);
            }

            printf("  OP[%3" PRIu32 "] %s\r\n", i, opName);

            /* Print input tensor indices */
            if (op->inputs() && op->inputs()->size() > 0)
            {
                printf("         inputs : [");
                for (uint32_t j = 0; j < op->inputs()->size(); j++)
                {
                    if (j > 0) printf(", ");
                    printf("%d", op->inputs()->Get(j));
                }
                printf("]\r\n");
            }

            /* Print output tensor indices */
            if (op->outputs() && op->outputs()->size() > 0)
            {
                printf("         outputs: [");
                for (uint32_t j = 0; j < op->outputs()->size(); j++)
                {
                    if (j > 0) printf(", ");
                    printf("%d", op->outputs()->Get(j));
                }
                printf("]\r\n");
            }
        }
    }

    /* ---- Subgraph I/O ---- */
    printf("\r\n========== SUBGRAPH I/O ==========\r\n");
    if (subgraph->inputs() && subgraph->inputs()->size() > 0)
    {
        printf("  Graph Inputs : [");
        for (uint32_t i = 0; i < subgraph->inputs()->size(); i++)
        {
            if (i > 0) printf(", ");
            printf("%d", subgraph->inputs()->Get(i));
        }
        printf("]\r\n");
    }
    if (subgraph->outputs() && subgraph->outputs()->size() > 0)
    {
        printf("  Graph Outputs: [");
        for (uint32_t i = 0; i < subgraph->outputs()->size(); i++)
        {
            if (i > 0) printf(", ");
            printf("%d", subgraph->outputs()->Get(i));
        }
        printf("]\r\n");
    }
    printf("========== END GRAPH DUMP ==========\r\n");
}

#endif /* !USE_SPLIT_MODEL */

/* ------------------------------------------------------------------ */
/*  API Implementation                                                */
/* ------------------------------------------------------------------ */

void ISM_Init(void)
{
    g_currentState = ISM_IDLE;
    g_requestState = ISM_IDLE;
#if defined(USE_SPLIT_MODEL) && (USE_SPLIT_MODEL == 1)
    g_zoLoadedFromFlash = false;
    g_zoPersistedTrainSteps = 0;
#endif
}

void ISM_SetState(ISM_State_t newState)
{
    g_requestState = newState;
}

ISM_State_t ISM_GetState(void)
{
    return g_currentState;
}

bool ISM_RequestCapturesFrame(void)
{
#if defined(USE_SPLIT_MODEL) && (USE_SPLIT_MODEL == 1)
    /* Both classify (this_is?) and one-step ZO training (tra=<label>) grab a
     * fresh camera frame, so both want the LCD blanked first. */
    return (g_requestState == ISM_SPLIT_INFERENCE) ||
           (g_requestState == ISM_ZO_TRAIN);
#else
    return (g_requestState == ISM_INFERENCE);
#endif
}

void ISM_Process(void)
{
    /* Check if there is a new request */
    if (g_requestState != ISM_IDLE)
    {
        g_currentState = g_requestState;
        g_requestState = ISM_IDLE; /* Clear request immediately */

        switch (g_currentState)
        {
#if !(defined(USE_SPLIT_MODEL) && (USE_SPLIT_MODEL == 1))
            case ISM_LOAD_MODEL:
                DoLoadModel();
                g_currentState = ISM_IDLE;
                break;

            case ISM_INFERENCE:
                DoInference();
                g_currentState = ISM_IDLE;
                break;

            case ISM_DUMP_GRAPH:
                DoGraphDump();
                g_currentState = ISM_IDLE;
                break;
#endif /* !USE_SPLIT_MODEL */

#if defined(USE_SPLIT_MODEL) && (USE_SPLIT_MODEL == 1)
            case ISM_LOAD_SPLIT_MODEL:
                DoLoadSplitModel();
                g_currentState = ISM_IDLE;
                break;

            case ISM_SPLIT_INFERENCE:
                DoSplitInference();
                g_currentState = ISM_IDLE;
                break;

            case ISM_ZO_INIT:
                DoZOInit();
                g_currentState = ISM_IDLE;
                break;

            case ISM_ZO_TRAIN:
                DoZOTrain();
                g_currentState = ISM_IDLE;
                break;
#endif

            case ISM_IDLE:
            default:
                break;
        }
    }
}